#+TITLE: CSE 361 Lecture Notes
#+OPTIONS: toc:nil
#+LATEX_HEADER: \usepackage{geometry,listings,amsmath,amssymb,amsthm}
#+LATEX_CLASS_OPTIONS: [12pt]
#+STARTUP: showall

* Analyze the function

#+BEGIN_SRC python
  def mystery(n):
      t = 0
      for i in range(1, n+1):
          s = 1
          for j in range(1, n+1):
              s = s * j
          t = t + s
      return t

  mystery(5)
#+END_SRC

#+RESULTS:
: 600

* Lecture 6

Given an array of real numbers, find a contiguous subarray with the
largest possible sum.

#+BEGIN_SRC python
  def A0(l):
      n = len(l)
      large = l[0]
      for i in range(n):
          for j in range(i,n):
              large = max(large, sum(l[i:j+1]))
      return large

  l = [1, 3, 4, 2, -7, 5]
  A0(l)
#+END_SRC

#+RESULTS:
: 10

#+BEGIN_SRC python
  def A1(l):
      n,largest = len(l),0
      for i in range(n):
          s = 0
          for j in range(i,n):
              s += l[j]
              largest = max(s,largest)
      return largest

  A1(l)

#+END_SRC

#+RESULTS:
: 10

#+BEGIN_SRC python
  def A2(l):
      c = [0]
      for i in range(len(l)):
          c.append(c[i] + l[i])
      largest = 0
      for i in range(len(l)):
          for j in range(i, len(l)):
              s = c[j+1] - c[i]
              largest = max(s, largest)
      return largest

              

  A2(l)
#+END_SRC

#+RESULTS:
: 10

#+BEGIN_SRC python
  def A3(a):
      n = len(a)
      m = n//2
      a1 = a[:n]
      a2 = a[n:]
      l = n-1
      r = n
      c = [0]
      for i in range(n):
          c.append(c[i]+a[i])
      
#+END_SRC

#+BEGIN_SRC python
  def A4(a):
      mf, mh = 0, 0
      for i in a:
          mh = max(mh+i, 0)
          mf = max(mf,mh)
      return mf

  A4(l)
#+END_SRC

#+RESULTS:
: 10

** Shell Sort

#+BEGIN_SRC python
  gaps = [23, 10, 5, 1]

  def gapISort(lst,start,gap):
      for i in range(start+gap, len(lst), gap):
          v = lst[i]
          p = i
          while p >= gap and lst[p-gap] > v:
              lst[p] = lst[p-gap]
              p = p - gap
          lst[p] = v
          print lst

  def shellSort(lst):
      for gap in [23,10,5,1]:
          for i in range(gap):
              gapISort(lst, i, gap)
      return lst

  shellSort([42,12,43,64,13,354,64,13,34,646,4523,31])
#+END_SRC

#+RESULTS:
| 12 | 13 | 13 | 31 | 34 | 42 | 43 | 64 | 64 | 354 | 646 | 4523 |

* Lecture 9

Get a random element from a pipe of unknown length using as little
storage as possible.

#+BEGIN_SRC python
  import random

  def getrand(l):
          n = 0
          c = None
          for e in l:
                  n += 1
                  r = random.randint(1, n)
                  if r == 1:
                          c = e
          return c

  getrand(range(11))
#+END_SRC

#+RESULTS:
: 8

